---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
Location Properties
Location Class See Also Send Feedback
---

The Location type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsReadOnly | Identifies if the object is read-only or modifiable. (Inherited from APIObject.) |

# See Also

Location Class

Autodesk.Revit.DB Namespace